matte/tags/1.3/src-test/magoffin/matt/ma2/web/service/get-collections-test-soap-01.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>test</wsse:Username>
				<wsse:Password>test</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<GetCollectionListRequest xmlns="http://msqr.us/xsd/matte"/>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
