matte/tags/1.0.1/src-test/magoffin/matt/ma2/web/service/get-collections-test-soapcall-01.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-CALL>
    <SOAP-FIELDS>
        <service xml:space="preserve">MatteService</service>
        <port xml:space="preserve">MattePort</port>
        <operation xml:space="preserve">GetCollectionList</operation>
        <URL xml:space="preserve">http://localhost:8484/matte/ws/Matte</URL>
        <action xml:space="preserve">http://msqr.us/matte/ws/GetCollectionList</action>
    </SOAP-FIELDS>
    <REQUEST><![CDATA[<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
<wsse:Security
xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken>
<wsse:Username>test</wsse:Username>
<wsse:Password>test</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<GetCollectionListRequest xmlns="http://msqr.us/xsd/matte"/>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
]]></REQUEST>
</SOAP-CALL>
