matte/tags/1.3.8/src-test/magoffin/matt/ma2/web/service/add-media-test-soapcall-01.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-CALL>
    <SOAP-FIELDS>
        <service xml:space="preserve">MatteService</service>
        <port xml:space="preserve">MattePort</port>
        <operation xml:space="preserve">AddMedia</operation>
        <URL xml:space="preserve">http://localhost:8484/matte/ws/Matte</URL>
        <action xml:space="preserve">http://msqr.us/matte/ws/AddMedia</action>
    </SOAP-FIELDS>
    <REQUEST><![CDATA[<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
<wsse:Security
xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken>
<wsse:Username>matte-admin</wsse:Username>
<wsse:Password>password</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</SOAP-ENV:Header>

	<SOAP-ENV:Body>
	<m:AddMediaRequest 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://msqr.us/xsd/matte ../../../../../../defs/schema/ws.xsd"
	xmlns:m="http://msqr.us/xsd/matte"
	xmlns:xmime="http://www.w3.org/2005/05/xmlmime"
	collection-id="3">
	
	<m:collection-import>
	<m:album name="AddMediaTestAlbum">
	<m:comment>This is a test album.</m:comment>
	<m:item archive-path="AddMediaTestAlbum/arrow-closed.png"
	name="Arrow Closed" rating="3">
	<m:comment>This is an arrow, closed.</m:comment>
	<m:keywords>test, arrow</m:keywords>
	</m:item>
	</m:album>
	</m:collection-import>
	</m:AddMediaRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
]]></REQUEST>
</SOAP-CALL>
